## pip install pandas

In [2]:
import pandas as pd

In [3]:
pd.__version__

'2.3.3'

In [5]:
df = pd.DataFrame([333, 444, 555, 666, 777, 888])
df

     0
0  333
1  444
2  555
3  666
4  777
5  888

In [7]:
type(df), df.dtypes

(pandas.core.frame.DataFrame,
 0    int64
 dtype: object)

In [8]:
df = pd.DataFrame( {
    "numere":  [333, 444, 555, 666, 777, 888]
    })
df

   numere
0     333
1     444
2     555
3     666
4     777
5     888

In [10]:
df = pd.DataFrame( {
    "numere":  [333, 444, 555, 666, 777, 888],
    "temperaturi" : [20, 30, 40, 22, 33, 44]
    })
df

   numere  temperaturi
0     333           20
1     444           30
2     555           40
3     666           22
4     777           33
5     888           44

In [ ]:
df.to_numpy()

array([[333,  20],
       [444,  30],
       [555,  40],
       [666,  22],
       [777,  33],
       [888,  44]])

In [12]:
df.to_dict()

{'numere': {0: 333, 1: 444, 2: 555, 3: 666, 4: 777, 5: 888},
 'temperaturi': {0: 20, 1: 30, 2: 40, 3: 22, 4: 33, 5: 44}}

In [15]:
df.to_csv("date_generate.csv")

In [16]:
df.to_excel("date_generate.xlsx")

In [18]:
read_df = pd.read_csv("date_generate.csv")
read_df

   Unnamed: 0  numere  temperaturi
0           0     333           20
1           1     444           30
2           2     555           40
3           3     666           22
4           4     777           33
5           5     888           44

In [19]:
read_df = pd.read_csv("date_generate.csv", index_col=0)
read_df

   numere  temperaturi
0     333           20
1     444           30
2     555           40
3     666           22
4     777           33
5     888           44

In [20]:
read_df.to_csv("date_generate_fara_index.csv", index=False)